Revit 2027 API
CompoundStructure.SplitRegion(UV, RectangularGridSegmentOrientation) Method
 Splits the region which contains the specified grid point by a line with the specified direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SplitRegion(
	UV gridUV,
	RectangularGridSegmentOrientation splitDirection
)
Public Function SplitRegion (
	gridUV As UV,
	splitDirection As RectangularGridSegmentOrientation
) As Integer
public:
int SplitRegion(
	UV^ gridUV,
	RectangularGridSegmentOrientation splitDirection
)
member SplitRegion :
        gridUV : UV *
        splitDirection : RectangularGridSegmentOrientation -> int
Parameters
gridUV UV
 Coordinates of a point in the rectangular grid of this compound structure.
splitDirection RectangularGridSegmentOrientation
 Specifies the direction of the split.
Return Value
Int32
 The id of the region created by this operation.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  Split and merge regions operations can be used only for vertically compound structures without variable thickness layers.
Remarks
 This method is meant to be used in conjunction with FindEnclosingRegionAndSegments(UV, RectangularGridSegmentOrientation, Int32, Int32). Grid coordinates correspond to uv coordinates of faces.
See Also
Reference
CompoundStructure Class
SplitRegion Overload
Autodesk.Revit.DB Namespace